PH_data/alpha_0.55/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
11509
(
( 3.082779949e-05 -5.474475984e-06 1.567072019e-07 1.964310104e-05 -5.588742624e-07 4.821926268e-05 )
( 3.048857252e-05 -5.082191365e-06 3.290079462e-07 1.947770579e-05 -6.436886792e-07 4.938771963e-05 )
( 3.011404806e-05 -4.41488919e-06 7.168973326e-08 1.583445555e-05 -3.657048069e-07 4.970534064e-05 )
( 3.144670336e-05 -5.795717698e-06 3.553389547e-07 2.154610593e-05 -6.690503938e-07 4.844908472e-05 )
( 2.962601684e-05 -4.079332484e-06 3.028392541e-07 1.57579052e-05 -4.856427722e-07 5.084324221e-05 )
( 3.020237818e-05 -4.781178177e-06 4.299146497e-07 1.929974314e-05 -6.114381677e-07 5.029233216e-05 )
( 2.999789285e-05 -3.863530765e-06 2.12619522e-08 1.365647859e-05 -2.68294599e-07 5.036434595e-05 )
( 3.019998621e-05 -4.000012268e-06 -8.670888008e-08 1.375964712e-05 -2.097734466e-07 4.993966286e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
