PH_data/alpha_0.55/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
11509
(
( -0.003034112509 0.000110233661 -0.0001399690809 )
( -0.002996726893 -9.207087714e-08 -0.0001352327963 )
( -0.003820951097 0.0001271481306 -8.110047202e-05 )
( -0.002442015801 -5.414667248e-05 -0.0001621457923 )
( -0.003797846148 3.073698463e-05 -6.945357018e-05 )
( -0.002977964701 -0.0001074297106 -0.0001274827082 )
( -0.004199074581 0.0001275331742 -4.532328603e-05 )
( -0.00419473974 0.0001556220814 -5.216245336e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
